schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
// ALL STATE
displayHeader dispHeader("dispHeader", _fonts[1]);
displayFooter dispFooter("dispFooter", _fonts[1]);
numbersBox    volBox("volBox");
uniList       myList("myList");
// RADIO
button2state  btn_RA_Mute("btn_RA_Mute");
button1state  btn_RA_prevSta("btn_RA_prevSta"), btn_RA_nextSta("btn_RA_nextSta");
button1state  btn_RA_staList("btn_RA_staList"), btn_RA_player("btn_RA_player"), btn_RA_dlna("btn_RA_dlna"), btn_RA_clock("btn_RA_clock");
button1state  btn_RA_sleep("btn_RA_sleep"), btn_RA_bt("btn_RA_bt");
button1state  btn_RA_off("btn_RA_off"), btn_RA_settings("btn_RA_settings");
pictureBox    pic_RA_logo("pic_RA_logo");
textbox       txt_RA_sTitle("txt_RA_sTitle"), txt_RA_staName("txt_RA_staName"), txt_RA_irNum("txt_RA_irNum");
vuMeter       VUmeter_RA("VUmeter_RA");
slider        sdr_RA_volume("sdr_RA_volume");
// STATIONSLIST
stationsList  lst_RADIO("lst_RADIO");
// PLAYER
button2state  btn_PL_Mute("btn_PL_Mute"), btn_PL_pause("btn_PL_pause");
button1state  btn_PL_ready("btn_PL_ready"), btn_PL_shuffle("btn_PL_shuffle");
button1state  btn_PL_playAll("btn_PL_playAll"), btn_PL_fileList("btn_PL_fileList"), btn_PL_radio("btn_PL_radio"), btn_PL_cancel("btn_PL_cancel");
button1state  btn_PL_prevFile("btn_PL_prevFile"), btn_PL_nextFile("btn_PL_nextFile"), btn_PL_off("btn_PL_off");
button1state  btn_PL_playNext("btn_PL_playNext"), btn_PL_playPrev("btn_PL_playPrev");
textbox       txt_PL_fName("txt_PL_fName");
slider        sdr_PL_volume("sdr_PL_volume");
pictureBox    pic_PL_logo("pic_PL_logo");
progressbar   pgb_PL_progress("pgb_PL_progress");
// AUDIOFILESLIST
fileList      lst_PLAYER("lst_PLAYER");
// DLNA
button2state  btn_DL_Mute("btn_DL_Mute"), btn_DL_pause("btn_DL_pause");
button1state  btn_DL_radio("btn_DL_radio"), btn_DL_fileList("btn_DL_fileList"), btn_DL_cancel("btn_DL_cancel");
textbox       txt_DL_fName("txt_DL_fName");
slider        sdr_DL_volume("sdr_DL_volume");
pictureBox    pic_DL_logo("pic_DL_logo");
progressbar   pgb_DL_progress("pgb_DL_progress");
// DLNAITEMSLIST
dlnaList      lst_DLNA("lst_DLNA", &dlna, &_dlnaHistory[0], 10);
// CLOCK
imgClock      clk_CL_green("clk_CL_green");
button2state  btn_CL_Mute("btn_CL_Mute");
button1state  btn_CL_alarm("btn_CL_alarm"), btn_CL_radio("btn_CL_radio"), btn_CL_off("btn_CL_off");
slider        sdr_CL_volume("sdr_CL_volume");
// ALARM
alarmClock    clk_AL_red("clk_CL_green");
button1state  btn_AL_left("btn_AL_left"), btn_AL_right("btn_AL_right"), btn_AL_up("btn_AL_up"), btn_AL_down("btn_AL_down");
button1state  btn_AL_ready("btn_AL_ready");
// SETTINGS
pictureBox    pic_SE_logo("pic_SE_logo");
button1state  btn_SE_bright("btn_SE_bright"), btn_SE_equal("btn_SE_equal"), btn_SE_radio("btn_SE_radio");
// BRIGHTNESS
button1state  btn_BR_ready("btn_BR_ready");
pictureBox    pic_BR_logo("pic_BR_logo");
slider        sdr_BR_value("sdr_BR_value");
textbox       txt_BR_value("txt_BR_value");
// SLEEPTIMER
button1state  btn_SL_up("btn_SL_up"), btn_SL_down("btn_SL_down"), btn_SL_ready("btn_SL_ready"), btn_SL_cancel("btn_SL_cancel");
// EQUALIZER
slider        sdr_EQ_lowPass("sdr_E_LP"), sdr_EQ_bandPass("sdr_E_BP"), sdr_EQ_highPass("sdr_E_HP"), sdr_EQ_balance("sdr_E_BAL");
textbox       txt_EQ_lowPass("txt_E_LP"), txt_EQ_bandPass("txt_E_BP"), txt_EQ_highPass("txt_E_HP"), txt_EQ_balance("txt_E_BAL");
button1state  btn_EQ_lowPass("btn_E_LP");
button1state  btn_EQ_bandPass("btn_E_BP"), btn_EQ_highPass("btn_E_HP"), btn_EQ_balance("btn_E_BAL");
button1state  btn_EQ_Radio("btn_EQ_Radio"), btn_EQ_Player("btn_EQ_Player");
button2state  btn_EQ_Mute("btn_EQ_Mute");
// BLUETOOTH
button2state  btn_BT_pause("btn_BT_pause"), btn_BT_power("btn_BT_power");
button1state  btn_BT_volDown("btn_BT_volDown"), btn_BT_volUp("btn_BT_volUp"), btn_BT_radio("btn_BT_radio"), btn_BT_mode("btn_BT_mode");
pictureBox    pic_BT_mode("pic_BT_mode");
textbox       txt_BT_mode("txt_BT_mode");
textbox       txt_BT_volume("txt_BT_volume");
// IR_SETTINGS
button1state  btn_IR_radio("btn_IR_radio");

/*  ╔═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
    ║                                                     D E F A U L T S E T T I N G S                                                         ║
    ╚═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format off
boolean defaultsettings(){

    if(!SD_MMC.exists("/ir_buttons.json")){  // if not found create one
        File file = SD_MMC.open("/ir_buttons.json", "w", true);
        file.write((uint8_t*)ir_buttons_json, sizeof(ir_buttons_json));
        file.close();
    }
    irb.loadButtonsFromJSON("/ir_buttons.json");
    for(uint i = 0; i < _settings.numOfIrButtons; i++) {
        ir.set_irButtons(i, _settings.irbuttons[i].val);
    }
    ir.set_irAddress(_settings.irbuttons[42].val);

    if(!SD_MMC.exists("/settings.json")){  // if not found create one
        updateSettings();
    }

    File file2 = SD_MMC.open("/settings.json","r", false);
    char*  jO = x_ps_calloc(2048, 1);
    char* tmp = x_ps_malloc(1024);
    file2.readBytes(jO, 2048);
    _settingsHash = simpleHash(jO);
    file2.close();

    auto parseJson = [&](const char* s) { // lambda, inner function
        int16_t pos1 = 0, pos2 = 0, pos3 = 0;
        pos1 = indexOf(jO, s, 0);
        if(pos1 < 0) {log_e("index %s not found", s); return "0";}
        pos2 = indexOf(jO, ":", pos1) + 1;
        if(jO[pos2] == '\"') pos3 = indexOf(jO, "\"", pos2 + 1) + 1;
        else pos3 = indexOf(jO, ",", pos2);
        if(pos3 < 0) pos3 = find_first_of(jO, "}\n", pos2);
        if(jO[pos2] == '\"'){pos2++; pos3--;}  // remove \" embraced strings
        strncpy(tmp, jO + pos2, pos3 - pos2);
        tmp[pos3 - pos2] = '\0';
        return (const char*)tmp;
    };

    auto computeMinuteOfTheDay = [&](const char* s){
        if(!s) return 0;
        int h = atoi(s);
        int m = atoi(s + 3);
        return h * 60 + m;
    };

    x_ps_free(_settings.lastconnectedhost);
    x_ps_free(_settings.lastconnectedfile);

    _cur_volume                 = atoi(   parseJson("\"volume\":"));
    _volumeSteps                = atoi(   parseJson("\"volumeSteps\":"));
    _ringVolume                 = atoi(   parseJson("\"ringVolume\":"));
    _volumeAfterAlarm           = atoi(   parseJson("\"volumeAfterAlarm\":"));
    _BTvolume                   = atoi(   parseJson("\"BTvolume\":"));
    _f_BTpower                  = (strcmp(parseJson("\"BTpower\":"), "true") == 0) ? 1 : 0;
    _btEmitterMode              = ((strcmp(parseJson("\"BTmode\":"), "TX") == 0) ? "TX" : "RX");
    _alarmtime[0]               = computeMinuteOfTheDay(parseJson("\"alarmtime_sun\":"));
    _alarmtime[1]               = computeMinuteOfTheDay(parseJson("\"alarmtime_mon\":"));
    _alarmtime[2]               = computeMinuteOfTheDay(parseJson("\"alarmtime_tue\":"));
    _alarmtime[3]               = computeMinuteOfTheDay(parseJson("\"alarmtime_wed\":"));
    _alarmtime[4]               = computeMinuteOfTheDay(parseJson("\"alarmtime_thu\":"));
    _alarmtime[5]               = computeMinuteOfTheDay(parseJson("\"alarmtime_fri\":"));
    _alarmtime[6]               = computeMinuteOfTheDay(parseJson("\"alarmtime_sat\":"));
    _alarmdays                  = atoi(       parseJson("\"alarm_weekdays\":"));
    _f_timeAnnouncement         = (strcmp(    parseJson("\"timeAnnouncing\":"), "true") == 0) ? 1 : 0;
    strcpy(_timeSpeechLang,                   parseJson("\"timeSpeechLang\":"));
    _f_mute                     = (strcmp(    parseJson("\"mute\":"), "true") == 0) ? 1 : 0;
    _brightness                 = atoi(       parseJson("\"brightness\":"));
    _sleeptime                  = atoi(       parseJson("\"sleeptime\":"));
    _cur_station                = atoi(       parseJson("\"station\":"));
    _toneLP                     = atoi(       parseJson("\"toneLP\":"));
    _toneBP                     = atoi(       parseJson("\"toneBP\":"));
    _toneHP                     = atoi(       parseJson("\"toneHP\":"));
    _toneBAL                    = atoi(       parseJson("\"balance\":"));
    _timeFormat                 = atoi(       parseJson("\"timeFormat\":"));
    _TZName                     =             parseJson("\"Timezone_Name\":");
    _TZString                   =             parseJson("\"Timezone_String\":");
    _settings.lastconnectedhost = x_ps_strdup(parseJson("\"lastconnectedhost\":"));
    _settings.lastconnectedfile = x_ps_strdup(parseJson("\"lastconnectedfile\":"));
    _sleepMode                  = atoi(       parseJson("\"sleepMode\":"));
    _state                      = atoi(       parseJson("\"state\":"));

