schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
                    if(_state == CLOCK){
                        if(_clockSubMenue == 2){ // scroll backward (alarm, radio, mute, off)
                            if(btnNr > 0) btnNr--;
                            if(btnNr == 0){btn_CL_alarm.showAlternativePic(); btn_CL_radio.show();}
                            if(btnNr == 1){btn_CL_radio.showAlternativePic(); btn_CL_Mute.show();}
                            if(btnNr == 2){btn_CL_Mute.showAlternativePic(); btn_CL_off.show();}
                            setTimeCounter(2);
                            return;
                        }
                    }
                    if(_state == ALARM){
                        if(_alarmSubMenue == 1){ // scroll backward (left, right, up, down, ready)
                            if(btnNr > 0) btnNr--;
                            if(btnNr == 0){btn_AL_left.showAlternativePic(); btn_AL_right.show();}
                            if(btnNr == 1){btn_AL_right.showAlternativePic(); btn_AL_up.show();}
                            if(btnNr == 2){btn_AL_up.showAlternativePic(); btn_AL_down.show();}
                            if(btnNr == 3){btn_AL_down.showAlternativePic(); btn_AL_ready.show();}
                            setTimeCounter(2);
                            return;
                        }
                    }
                    if(_state == SLEEPTIMER){
                        if(_sleepTimerSubMenue == 1){ // scroll backward (up, down, ready, cancel)
                            if(btnNr > 0) btnNr--;
                            if(btnNr == 0){btn_SL_up.showAlternativePic(); btn_SL_down.show();}
                            if(btnNr == 1){btn_SL_down.showAlternativePic(); btn_SL_ready.show();}
                            if(btnNr == 2){btn_SL_ready.showAlternativePic(); btn_SL_cancel.show();}
                            setTimeCounter(2);
                            return;
                        }
                    }
                    if(_state == SETTINGS){
                        if(_settingsSubMenue == 1){ // scroll forward (bright, equal, radio)
                            if(btnNr > 0) btnNr--;
                            if(btnNr == 0){btn_SE_bright.showAlternativePic(); btn_SE_equal.show();}
                            if(btnNr == 1){btn_SE_equal.showAlternativePic(); btn_SE_radio.show();}
                            setTimeCounter(2);
                            return;
                        }
                    }
                    if(_state == BRIGHTNESS){
                        if(_brightnessSubMenue == 1){
                            if(_brightness > 5) _brightness -= 5;
                            if(_brightness < 5) _brightness = 5;
                            sdr_BR_value.setValue(_brightness); setTimeCounter(2);
                            return;
                        }
                    }
                    if(_state == EQUALIZER){
                        if(_equalizerSubMenue == 1){
                            char c[10];
                            if(btnNr == 10){if(_toneBAL > -16){_toneBAL--; itoa(_toneBAL, c, 10); txt_EQ_balance.writeText(c); sdr_EQ_balance.setValue(_toneBAL);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // balance
                            if(btnNr == 20){if(_toneLP > -40){_toneLP--; itoa(_toneLP, c, 10); txt_EQ_lowPass.writeText(c); sdr_EQ_lowPass.setValue(_toneLP);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // LP
                            if(btnNr == 30){if(_toneBP > -40){_toneBP--; itoa(_toneBP, c, 10); txt_EQ_bandPass.writeText(c); sdr_EQ_bandPass.setValue(_toneBP);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // BP
                            if(btnNr == 40){if(_toneHP > -40){_toneHP--; itoa(_toneHP, c, 10); txt_EQ_highPass.writeText(c); sdr_EQ_highPass.setValue(_toneHP);} webSrv.send("settone=", setI2STone()); setTimeCounter(2); return;} // HP
                            if(btnNr == 1) {btnNr = 0; btn_EQ_Player.show(); btn_EQ_Radio.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 2) {btnNr = 1; btn_EQ_Mute.show(); btn_EQ_Player.showAlternativePic(); setTimeCounter(2); return;}
                        }
                    }
                    break;
        case 13:    // ARROW DOWN
                    if(_state == RADIO)  {txt_RA_staName.hide(); volBox.enable(); downvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME--
                    if(_state == STATIONSLIST) {lst_RADIO.nextStation(); setTimeCounter(4); break;} // station++
                    if(_state == PLAYER) {txt_PL_fName.hide();   volBox.enable(); downvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME--
                    if(_state == AUDIOFILESLIST){lst_PLAYER.nextFile(); setTimeCounter(4); break;} // file++
                    if(_state == DLNA)  {txt_DL_fName.hide(); volBox.enable(); downvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME--
                    if(_state == DLNAITEMSLIST){lst_DLNA.nextItem(); setTimeCounter(4); return;} // item++
                    if(_state == CLOCK) {downvolume(); setTimeCounter(2); break;} // VOLUME--
                    if(_state == SLEEPTIMER) {downvolume(); setTimeCounter(2); break;} // VOLUME--
                    if(_state == EQUALIZER && _equalizerSubMenue == 1){
                        if     (btnNr == 10){btnNr = 0;  btn_EQ_Radio.showAlternativePic();    btn_EQ_balance.show();}
                        else if(btnNr == 20){btnNr = 10; btn_EQ_balance.showAlternativePic();  btn_EQ_lowPass.show();}
                        else if(btnNr == 30){btnNr = 20; btn_EQ_lowPass.showAlternativePic();  btn_EQ_bandPass.show();}
                        else if(btnNr == 40){btnNr = 30; btn_EQ_bandPass.showAlternativePic(); btn_EQ_highPass.show();}
                        setTimeCounter(2); return;
                    }
                    break;
        case 14:    // ARROW UP
                    if(_state == RADIO)  {txt_RA_staName.hide(); volBox.enable(); upvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME++
                    if(_state == STATIONSLIST) {lst_RADIO.prevStation(); setTimeCounter(4); break;} // station--
                    if(_state == PLAYER) {txt_PL_fName.hide();   volBox.enable(); upvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME++
                    if(_state == AUDIOFILESLIST){lst_PLAYER.prevFile(); setTimeCounter(4); break;} // file-
                    if(_state == DLNA)  {txt_DL_fName.hide(); volBox.enable(); upvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME++
                    if(_state == DLNAITEMSLIST){lst_DLNA.prevItem(); setTimeCounter(4); return;} // item++
                    if(_state == CLOCK) {upvolume(); setTimeCounter(2); break;} // VOLUME++
                    if(_state == SLEEPTIMER) {upvolume(); setTimeCounter(2); break;} // VOLUME++
                    if(_state == EQUALIZER && _equalizerSubMenue == 1){
                        if     (btnNr <  10){btnNr = 10; btn_EQ_balance.showAlternativePic();  btn_EQ_Radio.show(); btn_EQ_Player.show(); btn_EQ_Mute.show();}
                        else if(btnNr == 10){btnNr = 20; btn_EQ_lowPass.showAlternativePic();  btn_EQ_balance.show();}
                        else if(btnNr == 20){btnNr = 30; btn_EQ_bandPass.showAlternativePic(); btn_EQ_lowPass.show();}
                        else if(btnNr == 30){btnNr = 40; btn_EQ_highPass.showAlternativePic(); btn_EQ_bandPass.show();}
                        setTimeCounter(2); return;
                    }
                    break;
        case 15:    // MODE
                    if(_state == SLEEPTIMER) {_radioSubMenue = 0; changeState(RADIO); break;} //  RADIO -> STATIONSLIST -> PLAYER -> DLNA -> CLOCK -> SLEEPTIMER
                    if(_state == RADIO) {changeState(STATIONSLIST); setTimeCounter(40); break;}
                    if(_state == STATIONSLIST) { _playerSubMenue = 0; changeState(PLAYER); break;}
                    if(_state == PLAYER) {changeState(AUDIOFILESLIST); break;}
                    if(_state == AUDIOFILESLIST) {_dlnaSubMenue = 0; changeState(DLNA); break;}
                    if(_state == DLNA) {_clockSubMenue = 0; changeState(CLOCK); break;}
                    if(_state == CLOCK) {_sleepTimerSubMenue =0; changeState(SLEEPTIMER); break;}
                    break;
        case 16:    // OK
                    if(_state == RADIO) {
                        if(_radioSubMenue == 4){
                            if(btnNr == 0){btn_RA_staList.showClickedPic(); vTaskDelay(100); btnNr = 0;                            changeState(STATIONSLIST); setTimeCounter(4); break;}
                            if(btnNr == 1){btn_RA_player.showClickedPic(); vTaskDelay(100); btnNr = 0;    _playerSubMenue = 2;     changeState(PLAYER);       setTimeCounter(2); break;}
                            if(btnNr == 2){btn_RA_dlna.showClickedPic();   vTaskDelay(100); btnNr = 0;    _dlnaSubMenue = 1;       changeState(DLNA);         setTimeCounter(2); break;}
                            if(btnNr == 3){btn_RA_clock.showClickedPic();  vTaskDelay(100); btnNr = 0;    _clockSubMenue = 2;      changeState(CLOCK);        setTimeCounter(2); break;}
                            if(btnNr == 4){btn_RA_sleep.showClickedPic();  vTaskDelay(100); btnNr = 0;    _sleepTimerSubMenue = 1; changeState(SLEEPTIMER);   setTimeCounter(2); break;}
                            if(btnNr == 5){btn_RA_settings.showClickedPic(); vTaskDelay(100); btnNr = 0;  _settingsSubMenue = 1;   changeState(SETTINGS);     setTimeCounter(2); break;}
                            if(btnNr == 6){btn_RA_bt.showClickedPic();     vTaskDelay(100); btnNr = 0; changeState(BLUETOOTH); break;}
                            if(btnNr == 7){btn_RA_off.showClickedPic();    vTaskDelay(100); fall_asleep(); break;}
                        }
                        else{
                            _radioSubMenue = 4; btnNr = 0; changeState(RADIO);
                        }
                        break;
                    }
                    if(_state == STATIONSLIST)   {setStationByNumber(lst_RADIO.getSelectedStation()); _radioSubMenue = 0; changeState(RADIO); break;}
                    if(_state == PLAYER){
                        if(_playerSubMenue == 0){_playerSubMenue = 2; btnNr = 0; changeState(PLAYER); setTimeCounter(2); break;}
                        if(_playerSubMenue == 1){_playerSubMenue = 3; btnNr = 0; changeState(PLAYER); setTimeCounter(2); break;}
                        if(_playerSubMenue == 2){
                            if(btnNr == 0){ // prev AudioFile
                                            btn_PL_prevFile.showClickedPic(); vTaskDelay(50); btn_PL_prevFile.showAlternativePic(); if(_cur_AudioFileNr > 0) {_cur_AudioFileNr--;
                                            showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); setTimeCounter(2);} return;}
                            if(btnNr == 1){ // next AudioFile
                                            btn_PL_nextFile.showClickedPic(); vTaskDelay(50); btn_PL_nextFile.showAlternativePic(); if(_cur_AudioFileNr + 1 < _SD_content.getSize()) {_cur_AudioFileNr++;
                                            showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); setTimeCounter(2);} return;}
                            if(btnNr == 2){ // play file
                                            btn_PL_ready.showClickedPic(); vTaskDelay(100); stopSong(); SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr));
                                            btnNr = 0; _playerSubMenue = 3; changeState(PLAYER); showAudioFileNumber(); setTimeCounter(2); return;}
                            if(btnNr == 3){ // play all files
                                            btn_PL_playAll.showClickedPic(); _f_shuffle = false; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true);
                                            _playerSubMenue = 1; changeState(PLAYER); return;}
                            if(btnNr == 4){ // shuffle and play all files
                                            btn_PL_shuffle.showClickedPic(); vTaskDelay(100);  _f_shuffle = true; preparePlaylistFromSDFolder(_cur_AudioFolder); processPlaylist(true);
                                            _playerSubMenue = 1; changeState(PLAYER); return;}
                            if(btnNr == 5){ // show file list
                                            btn_PL_fileList.showClickedPic(); vTaskDelay(100); _SD_content.listFilesInDir(_cur_AudioFolder, true, false);
                                            changeState(AUDIOFILESLIST); return;}
                            if(btnNr == 6){ // back to radio
                                            btn_PL_radio.showClickedPic(); vTaskDelay(100); setStation(_cur_station);_playerSubMenue = 0; _radioSubMenue = 0; changeState(RADIO); return;}
                            if(btnNr == 7){ // off
                                            btn_PL_off.showClickedPic(); vTaskDelay(100); fall_asleep(); return;}
                        }
                        if(_playerSubMenue == 3){
                            if(btnNr == 0){ // mute
                                            btn_PL_Mute.showClickedPic(); muteChanged(!_f_mute); vTaskDelay(100); btn_PL_Mute.showAlternativePic(); setTimeCounter(2); return;
                            }
                            if(btnNr == 1){ // pause
                                            btn_PL_pause.showClickedPic(); if(_f_isFSConnected) {_f_pauseResume = audio.pauseResume(); if(!audio.isRunning()) btn_PL_pause.setOn(); else btn_PL_pause.setOff();}
                                            vTaskDelay(100); btn_PL_pause.showAlternativePic(); setTimeCounter(2); return;
                            }
                            if(btnNr == 2){ // cancel
                                            btn_PL_cancel.showClickedPic(); vTaskDelay(100); btnNr = 0; _playerSubMenue = 2; stopSong(); changeState(PLAYER); return;
                            }
                            if(btnNr == 3){ // prev
                                            btn_PL_playPrev.showClickedPic(); vTaskDelay(100); btn_PL_playPrev.showAlternativePic(); _cur_AudioFileNr = _SD_content.getPrevAudioFile(_cur_AudioFileNr);
                                            SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); setTimeCounter(2); return;
                            }
                            if(btnNr == 4){ // next
                                            btn_PL_playNext.showClickedPic(); vTaskDelay(100); btn_PL_playNext.showAlternativePic(); _cur_AudioFileNr = _SD_content.getNextAudioFile(_cur_AudioFileNr);
                                            SD_playFile(_cur_AudioFolder, _SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber(); setTimeCounter(2); return;
                            }
                        }

