schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
                    }
                    if(_state == AUDIOFILESLIST){   const char* r = lst_PLAYER.getSelectedFile();
                                            if(r){stopSong(); SD_playFile(lst_PLAYER.getSelectedFilePath(), 0, true); _cur_AudioFileNr = lst_PLAYER.getSelectedFileNr();}
                    }
                    if(_state == DLNA) {
                        if(_dlnaSubMenue == 0) { _dlnaSubMenue = 1; btnNr = 0; changeState(DLNA); setTimeCounter(2); break;}
                        if(_dlnaSubMenue == 1) {
                            if(btnNr == 0){ // mute
                                            btn_DL_Mute.showClickedPic(); muteChanged(!_f_mute); vTaskDelay(100); btn_DL_Mute.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 1){ // pause
                                            if(!btn_DL_pause.getActive()) {setTimeCounter(2); return;}// is inactive
                                            btn_DL_pause.showClickedPic(); if(_f_isWebConnected) {_f_pauseResume = audio.pauseResume(); if(!audio.isRunning()) btn_DL_pause.setOn(); else btn_DL_pause.setOff();}
                                            vTaskDelay(100); btn_DL_pause.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 2){ // cancel
                                            btn_DL_cancel.showClickedPic(); vTaskDelay(100); btn_DL_cancel.show(); stopSong(); txt_DL_fName.setText(""); txt_DL_fName.hide(); pgb_DL_progress.reset();
                                            btn_DL_pause.setActive(false); btn_DL_pause.show(); setTimeCounter(2); return;}
                            if(btnNr == 3){ // dlna list
                                            changeState(DLNAITEMSLIST); txt_DL_fName.setText(""); return;}
                            if(btnNr == 4){ // back to radio
                                            btn_DL_radio.showClickedPic(); vTaskDelay(100); setStation(_cur_station); _playerSubMenue = 0; _radioSubMenue = 0; changeState(RADIO); return;}
                        }
                        break;
                    }
                    if(_state == DLNAITEMSLIST) {setTimeCounter(2); const char* r = lst_DLNA.getSelectedURL();
                                                 if(r){txt_DL_fName.setTextColor(TFT_CYAN); txt_DL_fName.setText(lst_DLNA.getSelectedTitle(), TFT_ALIGN_LEFT, TFT_ALIGN_CENTER);
                                                       _dlnaSubMenue = 0; changeState(DLNA); connecttohost(r);}
                                                 break;
                    }
                    if(_state == CLOCK){
                        if(_clockSubMenue == 0) { _clockSubMenue = 2; btnNr = 0; changeState(CLOCK); setTimeCounter(2); break;}
                        if(_clockSubMenue == 2){
                            if(btnNr == 0){ // Alarm
                                            _alarmSubMenue = 1; btnNr = 0; btn_CL_alarm.showClickedPic(); vTaskDelay(100); changeState(ALARM); return;}
                            if(btnNr == 1){ // Radio
                                            btn_CL_radio.showClickedPic(); vTaskDelay(100); setStation(_cur_station);_playerSubMenue = 0; _radioSubMenue = 0; changeState(RADIO); return;}
                            if(btnNr == 2){ // Mute
                                            btn_CL_Mute.showClickedPic(); muteChanged(!_f_mute); vTaskDelay(100); btn_CL_Mute.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 3){ // Off
                                            btn_CL_off.showClickedPic(); vTaskDelay(100); fall_asleep(); return;}
                        }
                    }
                    if(_state == ALARM){
                        if(_alarmSubMenue == 0) { _alarmSubMenue = 1; btnNr = 0; changeState(ALARM); setTimeCounter(2); return;}
                        if(_alarmSubMenue == 1){
                            if(btnNr == 0){ // pos left
                                btn_AL_left.showClickedPic(); clk_AL_red.shiftLeft(); btn_AL_left.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 1){ // pos right
                                btn_AL_right.showClickedPic(); clk_AL_red.shiftRight(); btn_AL_right.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 2){ // pos +1
                                btn_AL_up.showClickedPic(); clk_AL_red.digitUp(); btn_AL_up.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 3){ // pos -1
                                btn_AL_down.showClickedPic(); clk_AL_red.digitDown(); btn_AL_down.showAlternativePic(); setTimeCounter(2); return;}
                            if(btnNr == 4){ // ready
                                btn_AL_ready.showClickedPic(); vTaskDelay(100); updateSettings(); _clockSubMenue = 0; changeState(CLOCK); logAlarmItems(); return;}
                        }
                    }
                    if(_state == SLEEPTIMER) {
                        if(_sleepTimerSubMenue == 0){
                            _sleepTimerSubMenue = 1; btnNr = 0; changeState(SLEEPTIMER); setTimeCounter(2); return;}
                        if(_sleepTimerSubMenue == 1){
                            if(btnNr == 0){btn_SL_up.showClickedPic(); display_sleeptime(1); btn_SL_up.showAlternativePic(); return;}
                            if(btnNr == 1){btn_SL_down.showClickedPic(); display_sleeptime(-1); btn_SL_down.showAlternativePic(); return;}
                            if(btnNr == 2){btn_SL_ready.showClickedPic(); vTaskDelay(100); dispFooter.updateOffTime(_sleeptime); _radioSubMenue = 0; changeState(RADIO); return;}
                            if(btnNr == 3){ btn_SL_cancel.showClickedPic(); vTaskDelay(100); _radioSubMenue = 0; changeState(RADIO); return;}
                        }
                    }
                    if(_state == SETTINGS){
                        if(_settingsSubMenue == 0){_settingsSubMenue = 1; btnNr = 0; changeState(SETTINGS); setTimeCounter(2); return;}
                        if(_settingsSubMenue == 1){
                            if(btnNr == 0){btn_SE_bright.showClickedPic(); vTaskDelay(100); btnNr = 0; _brightnessSubMenue = 1;  changeState(BRIGHTNESS); setTimeCounter(2); return;}
                            if(btnNr == 1){btn_SE_equal.showClickedPic(); vTaskDelay(100); btnNr = 0; _equalizerSubMenue = 1; changeState(EQUALIZER); setTimeCounter(2); return;}
                            if(btnNr == 2){btn_SE_radio.showClickedPic(); vTaskDelay(100); _radioSubMenue = 0; changeState(RADIO); return;}
                        }
                    }
                    if(_state == BRIGHTNESS){
                        if(_brightnessSubMenue == 0){_brightnessSubMenue = 1; btnNr = 0; changeState(BRIGHTNESS); setTimeCounter(2); return;}
                        if(_brightnessSubMenue == 1){_radioSubMenue = 0; changeState(RADIO); return;}
                    }
                    if(_state == EQUALIZER){
                        if(_equalizerSubMenue == 0){_equalizerSubMenue = 1; btnNr = 0; changeState(EQUALIZER); setTimeCounter(2); return;}
                        if(_equalizerSubMenue == 1){
                            if(btnNr == 0){btn_EQ_Radio.showClickedPic(); vTaskDelay(100);  setStation(_cur_station); _radioSubMenue = 0; changeState(RADIO); return;} // Radio
                            if(btnNr == 1){btn_EQ_Player.showClickedPic(); vTaskDelay(100); _playerSubMenue = 0; changeState(PLAYER); return;} // Player
                            if(btnNr == 2){btn_EQ_Mute.showClickedPic(); vTaskDelay(100);  muteChanged(!_f_mute); btn_EQ_Mute.showAlternativePic(); setTimeCounter(2); return;} // Mute
                            if(btnNr == 10){btn_EQ_balance.showClickedPic(); _toneBAL = 0; txt_EQ_balance.writeText("0");  sdr_EQ_balance.setValue(_toneLP);  webSrv.send("settone=", setI2STone()); btn_EQ_balance.showAlternativePic();}
                            if(btnNr == 20){btn_EQ_lowPass.showClickedPic();  _toneLP = 0; txt_EQ_lowPass.writeText("0");  sdr_EQ_lowPass.setValue(_toneLP);  webSrv.send("settone=", setI2STone()); btn_EQ_lowPass.showAlternativePic();}
                            if(btnNr == 30){btn_EQ_bandPass.showClickedPic(); _toneBP = 0; txt_EQ_bandPass.writeText("0"); sdr_EQ_bandPass.setValue(_toneLP); webSrv.send("settone=", setI2STone()); btn_EQ_bandPass.showAlternativePic();}
                            if(btnNr == 40){btn_EQ_highPass.showClickedPic(); _toneHP = 0; txt_EQ_highPass.writeText("0"); sdr_EQ_highPass.setValue(_toneLP); webSrv.send("settone=", setI2STone()); btn_EQ_highPass.showAlternativePic();}
                        }
                        setTimeCounter(2); return;
                    }
                    break;
        case 18:    if(_state == PLAYER){if(_f_isFSConnected) _f_pauseResume = audio.pauseResume();} break;
        case 19:    if(_state == PLAYER){if(_f_isFSConnected) audio.stopSong(); _playerSubMenue = 0; changeState(PLAYER);} break;
        case 20:    _f_irOnOff = ! _f_irOnOff;
                    if(_f_irOnOff) fall_asleep();
                    else           wake_up();
                    break;
        case 21:    if(_state != RADIO)      {_radioSubMenue      = 0; setStation(_cur_station); changeState(RADIO);}      break;
        case 22:    if(_state != PLAYER)     {_playerSubMenue     = 0; changeState(PLAYER);}     break;
        case 23:    if(_state != DLNA)       {_dlnaSubMenue       = 0; changeState(DLNA);}       break;
        case 24:    if(_state != CLOCK)      {_clockSubMenue      = 0; changeState(CLOCK);}      break;
        case 25:    if(_state != SLEEPTIMER) {_sleepTimerSubMenue = 0; changeState(SLEEPTIMER);} break;
        case 26:    // VOLUME+
                    if(_state == RADIO)  {txt_RA_staName.hide(); volBox.enable(); upvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME++
                    if(_state == PLAYER) {txt_PL_fName.hide();   volBox.enable(); upvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME++
                    if(_state == DLNA)  {txt_DL_fName.hide(); volBox.enable(); upvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME++
                    if(_state == CLOCK) {upvolume(); setTimeCounter(2); break;} // VOLUME++
                    if(_state == SLEEPTIMER) {upvolume(); setTimeCounter(2); break;} // VOLUME++
                    upvolume(); break;
        case 27:    // VOLUME-
                    if(_state == RADIO)  {txt_RA_staName.hide(); volBox.enable(); downvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME--
                    if(_state == PLAYER) {txt_PL_fName.hide();   volBox.enable(); downvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME--
                    if(_state == DLNA)  {txt_DL_fName.hide(); volBox.enable(); downvolume(); volBox.setNumbers(_cur_volume); volBox.show(); setTimeCounter(2); break;} // VOLUME--
                    if(_state == CLOCK) {downvolume(); setTimeCounter(2); break;} // VOLUME--
                    if(_state == SLEEPTIMER) {downvolume(); setTimeCounter(2); break;} // VOLUME--
                    downvolume(); break;
        case 28:    if(_state == PLAYER) {if(audio.isRunning()) audio.setTimeOffset(-30);}       break;
        case 29:    if(_state == PLAYER) {if(audio.isRunning()) audio.setTimeOffset(+30);}       break;
        default:    break;
    }
}
void ir_long_key(int8_t key) {
    SerialPrintfln("ir_code: ..  " ANSI_ESC_YELLOW "long pressed key nr: " ANSI_ESC_BLUE "%02i", key);
    if(key == 30) fall_asleep(); // long mute
    if(key == 31){ // cancel
        if(_state == STATIONSLIST) {_radioSubMenue = 0; changeState(RADIO);}
        if(_state == SLEEPTIMER)   {_radioSubMenue = 0; changeState(RADIO);}
    }
}
//----------------------------------------------------------------------------------------------------------------------------------------------------
// Event from TouchPad
// clang-format off
void tp_pressed(uint16_t x, uint16_t y) {
    //  SerialPrintfln(ANSI_ESC_YELLOW "Touchpoint  x=%d, y=%d", x, y);
    if(_f_sleeping) return;  // awake in tp_released()
    const char* objName = NULL;
    if(_state == RADIO && y > _winHeader.y && y < _sdrOvBtns.y){
        objName = "backpane";
        _radioSubMenue++;
        if(_radioSubMenue == 3) _radioSubMenue = 0;
        changeState(RADIO);
        goto exit;
    }
    objName = isObjectClicked(x, y);
exit:
    if(objName) SerialPrintfln("click on ..  %s", objName);
    return;
}
void tp_long_pressed(uint16_t x, uint16_t y){

